[
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/CUHK-Esther.jpg",
    "name": "Esther Won",
    "bio": "South Korea, CUHK, Year 3",
    "testimony": "God has revealed a lot about myself through life group how much I want to be in control of my life and how little did I invite God into my life. God really used LIFE group community to allow me to genuinely experience and be reminded of his love and goodness. I learned how to process through my problems not just avoiding them and seeking for God’s guidance. I am amazed how God worked through my life this past year and I really hope people can experience what I have experienced through this community!",
    "backgroundStyle": "linear-gradient(104.2deg, rgba(254, 252, 191, 0.2) 25.66%, rgba(255, 255, 255, 0.2) 53.64%, rgba(233, 216, 253, 0.2) 80.74%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/HKU-Audrey.jpg",
    "name": "Audrey Febrina",
    "bio": "Indonesia, HKU, Year 2",
    "testimony": "In LIFE Group I was able to find a welcoming community who accepted me for who I am. My friends in LIFE Group, out of their love for me, encouraged and challenged me to become more like Christ. Because of them, I was able to experience growth spiritually, emotionally, and socially. Being in such a warm community reminded me that God is always taking care of me, even when I’m 2,500km away from home.",
    "backgroundStyle": "linear-gradient(90.13deg, rgba(196, 241, 249, 0.2) 5.9%, rgba(255, 255, 255, 0.2) 49.28%, rgba(254, 252, 191, 0.2) 92.65%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/HKUST-Jasper.jpg",
    "name": "Jasper Chiu",
    "bio": "Hong Kong, HKUST, Year 3",
    "testimony": "I was reached out during Operation Campus Reach back in 2020. My first experience at LIFE group was incredible, I was amazed by how welcoming and loving people there were; interactions felt natural to a point where I was able to open up without much difficulties. Throughout the year, I am glad to be involved in the process of building a faith-based community, and more importantly, I was able to see how God is constantly transforming my life.",
    "backgroundStyle": "linear-gradient(90.13deg, rgba(255, 217, 192, 0.2) 21.41%, rgba(255, 255, 255, 0.2) 53.91%, rgba(198, 246, 213, 0.2) 86.41%, rgba(198, 246, 213, 0.2) 86.41%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/HKBU-Alaba.jpg",
    "name": "Alaba Adesanya Chukwuka",
    "bio": "Nigeria, HKBU, Year 2",
    "testimony": "Coming to Hong Kong for university, I had no plans of continuing in a Church but when a friend invited me for a LIFE Group sleepover, I felt so welcomed despite being a stranger. Since then, I have experienced love and community and had people to walk with me in faith who loved and cared about me enough to challenge me and help me grow closer to God and as a person.",
    "backgroundStyle": "linear-gradient(90.28deg, rgba(233, 216, 253, 0.2) 18.01%, rgba(255, 255, 255, 0.2) 55.98%, rgba(190, 227, 248, 0.2) 92.75%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/PolyU-Ting.jpg",
    "name": "Ting Sen",
    "bio": "Malaysia, PolyU, Year 3",
    "testimony": "Studying in Hong Kong is nothing short of a miracle that God has blessed me with. Even though there were lots of ups and downs, but having a community like LIFE group to depend on and share my struggles with really helped me to overcome them. It was also this community that I get to share vulnerably and experience healing from God and rebuild my relationship with Him.",
    "backgroundStyle": "linear-gradient(90.13deg, rgba(190, 227, 248, 0.2) 11.65%, rgba(255, 255, 255, 0.2) 46.78%, rgba(254, 235, 203, 0.2) 80.81%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/CamillaYu.jpg",
    "name": "Camilla Yu",
    "bio": "China, Covenant",
    "testimony": "I have joined Covenant LG since 2016. It is a safe venue for all couples to share struggles in marriage or parenting openly. I always get inspired and encouraged whether through a Bible study, a fun gathering, or an LCG coffee time. The leaders also showed us how to walk with God as a family. I'm very thankful that God provides this community for us in Hong Kong!",
    "backgroundStyle": "linear-gradient(90.08deg, rgba(254, 252, 191, 0.2) 20.37%, rgba(255, 255, 255, 0.2) 51%, rgba(254, 215, 226, 0.2) 80.66%), #FFFFFF"
  },
  {
    "imageUrl": "https://hongkong.sub.hmcc.net/wp-content/uploads/Makoto.jpg",
    "name": "Makoto Yagi",
    "bio": "Japan, Focus",
    "testimony": "My LIFE Group started with 30+ people and someone mentioned that it could grow to 60+ people by the end of the year. I doubted it BUT as people were experiencing more of the community, it started expanding to the point of a mini-church size! It was such a powerful reminder of God's power and plan always works, even when I don't trust it, He will work it out for His Kingdom's glory!",
    "backgroundStyle": "linear-gradient(90.37deg, rgba(196, 241, 249, 0.2) 23.55%, rgba(255, 255, 255, 0.2) 52.59%, rgba(198, 246, 213, 0.2) 80.71%), #FFFFFF"
  }
]
