[
  {
    "title": "Why now? Why are we moving into a permanent facility instead of other options?",
    "content": "We are moving into a permanent facility to be rooted so that it can become a hub where we can see life transformation and reach out to our community, city and beyond. We only have our current space at KOHO on short-term leases, where we are only renting an office space for the weekends and we can get evicted at any moment’s notice if a company wishes to sign and lease the space long term. The current situation is that our lease with KOHO comes to an end in late-October as the management has decided to use the space for other company purposes. This is why we are looking to move at this time. As our church grows, we have been praying that God would provide something for us that we can grow into and be rooted in.\n\nAfter 8+ years of moving from place to place, from classrooms, party rooms, event spaces, to office spaces, there is not a suitable venue that is conducive for the ministry and the growth of our church. We believe that investing in a permanent facility would bring much needed stability to our church and enable us to grow and use it as a hub where we can see life transformation and send people out to reach the communities in the city and transform the world."
  },
  {
    "title": "What is the Ripple Out Campaign and the Saturate Vision?",
    "content": "The Ripple Out Campaign aims to help us accomplish our mission of “transforming lives and transforming the world” and the Saturate Vision by securing a permanent home for our church family so that we would be able to gather to worship together, train and be equipped, and open up missional opportunities to serve our community and our city. In order to see our vision become a reality, we are launching this campaign to invite our church family and supporters to help fund this project of creating a permanent space where we can reach out to more people with the Gospel.\n\nThe Saturate Vision is our church’s vision from January 2024 to December 2029. This vision is inspired by the passage from Habakkuk 2:14 (ESV), “For the earth will be filled with the knowledge of the glory of the Lord as the waters cover the sea”, where we desire to saturate Hong Kong with the knowledge of God’s glory by living out the Kingdom lifestyle and proclaiming the Gospel, so that we can make more Christ’s disciples of all nations locally, regionally, and globally for the spread of Jesus’ fame. We believe the Ripple Out Campaign is critical in helping us live out the Saturate Vision by having a permanent home for our church so that we can gather, grow, and go into Hong Kong and the rest of the world."
  },
  {
    "title": "Where is the new church venue located?",
    "content": "Our new church home will be located on the 22/F of the Crocodile Center in Kwun Tong. Located in the heart of Kwun Tong, the building is a Grade A commercial building that is directly connected to the Kwun Tong MTR station and the APM Shopping Arcade. We believe this is an accessible and strategic location that would enable us to grow and expand for the foreseeable future."
  },
  {
    "title": "Why are we moving to a new venue in Kwun Tong?",
    "content": "Kwun Tong is a strategic location that is seeing unprecedented growth and development. According to the Development Bureau of the Government of the HKSAR, the area is seeing industrial revitalization and urban transformation efforts in order to transform Kowloon East into a new central business district in Hong Kong. It is worth noting that the district also faces significant challenges, including high poverty rates and an aging population. We believe that this creates an opportunity for us to have a missional presence as we saturate the area with the knowledge of the glory of God."
  },
  {
    "title": "How will we use the facility for our church’s gatherings?",
    "content": "Our vision is to create a permanent home for our church that would allow us to carry out our ministries where we can worship together as a church and be an equipping, training, and sending hub as we seek to transform lives and transform the world. We are designing a flexible space that can accommodate up to 200 people in the main sanctuary where we will have our Sunday Celebration and other corporate gatherings and trainings. On top of this, we are designing a common fellowship area that LIFE Group and communities can gather, some enclosed rooms for classes, seminars, Building Blocks children’s ministry and Latitude youth ministry to invest in and equip the next generation, and an office for our pastoral staff."
  },
  {
    "title": "How will we use the facility as a missional space for missional initiatives and community outreaches throughout the week?",
    "content": "Outside of Sundays and the weekends, we want to open up the space and use it as a missional space to reach the people in our community around us, e.g. the youth, elderly, marginalized, and our city. The flexible main space can be repurposed for outreach events and seminars as well as enclosed rooms for smaller gatherings and events. Our vision is to create a space where we can make room for those who have yet to encounter the Gospel to experience the transformative power of Christ and the Gospel."
  },
  {
    "title": "What is the process and timeline for moving into the new space?",
    "content": "We are currently in the handover process of securing the contract and getting keys and access to the place. We will also start renovation works to put the place together that is conducive for our church home. At the moment, we are targeting to move in sometime during November 2023. We will give updates to our church family as the move-in date becomes more clear."
  },
  {
    "title": "How long do we have the space for?",
    "content": "We will have the space for 6 years per our lease agreement, with future possibilities to extend after the current lease ends. We want to see this new space as a permanent home that we can grow into and use it as a training, equipping and sending hub."
  },
  {
    "title": "How are we financing the new space as a church?",
    "content": "We will be financing the new space via two main sources: our annual operating budget and fundraising through the Ripple Out Campaign. \n\nWe will budget the monthly rentals into our annual operating budget that our church members contribute with their tithes and offerings. As for the renovation, move-in, and other administrative costs, we will be raising these funds through our Ripple Out Campaign.\n\nRefer to the “Giving Campaign” section for more details on how you can contribute financially."
  },
  {
    "title": "How can I get involved and contribute to the Ripple Out Campaign?",
    "content": "We cannot do this without you and every single person in our church participating, as well as some of you who are alumni of our church. As we have experienced the generosity that we have received from Christ’s sacrifice, may we be encouraged to be generous for each of us to play our part to make this vision become a reality. When our lives have been transformed, we want to see other people’s lives to experience transformation through the Gospel. \n\nThough the amount we each give may not be the same, we believe that we can be generous as we give in different sums, but equal sacrifice. Refer to the “Giving Campaign” section for more details on how you can contribute financially.\n\nBesides finances, we also ask for you to be in prayer for the Ripple Out Campaign and the Saturate Vision as we pray for God’s guidance and provision. "
  }
]
