[
  {
    "imageUrl": "/images/ripple-out/ripple-out-story-1.png",
    "content": "Harvest Mission Community Church (HMCC) has always been about “transforming lives and transforming the world.” This is our passion. This is our mission. Ever since HMCC got started back in 1996 on the campus of the University of Michigan, in the U.S., and in Hong Kong back in 2015, we have focused on proclaiming the transformative message of the Gospel because the Gospel changes everything."
  },
  {
    "imageUrl": "/images/ripple-out/ripple-out-story-2.png",
    "content": "Over the years, we realized that in order for this dream to become a reality, we need to start here in Hong Kong, and then ripple out to reach the nations. Therefore, starting in January 2024 until December 2029, we are going to launch our Saturate Vision. "
  },
  {
    "imageUrl": "/images/ripple-out/ripple-out-story-3.png",
    "content": "The vision is simply ”to saturate Hong Kong with the knowledge of God’s glory by living out the Kingdom lifestyle and proclaiming the Gospel, so that we can make more Christ’s disciples of all nations locally, regionally, and globally for the spread of Jesus’s This vision was inspired by the passage from Habakkuk 2:14 (ESV), “For the earth will be filled with the knowledge of the glory of the LORD as the waters cover the sea.”"
  },
  {
    "imageUrl": "/images/ripple-out/ripple-out-story-4.png",
    "content": "By God’s grace, we have been able to find a location for our whole church to physically gather together! This space will be our church home where we will have our Sunday Celebrations, a place for our LIFE Group and ministry-related gatherings, and a space to train, equip, and send out people to do the ministry. It is also on our hearts to use the space to reach out and serve our community throughout the week. A permanent place will not only give us a missional presence in the neighborhood, but also brings stability to our church. This will open up opportunities to minister to the community with the Gospel and saturate the city of Hong Kong."
  },
  {
    "imageUrl": "/images/ripple-out/ripple-out-story-5.png",
    "content": "In order to prepare the facility for all that God is calling us to do, we are launching our Ripple Out Campaign to fund this project. We are praying that out of the generosity that we have received from Christ’s sacrifice we will be able to reflect His heart and character by being generous so that we may reach out to more people with the Gospel. As we have always said, “We are blessed to be a blessing!” We cannot do this without you and every single person in our church participating, as well as some of you who are alumnis of our church. We invite you to pray with us and depend on God, who is the Jehovah-Jireh, our God who provides. May we continue to send out ripples from Hong Kong!"
  }
]