{
  "banner": {
    "title": "About Us",
    "blurb": "Harvest Mission Community Church of Hong Kong is an international church with a vision to reach this great city of Hong Kong and be a 1st-century church in the 21st century. We value transculturalism and we are actively reaching out to people from all walks of life, specifically university students, working adults, and families."
  },
  "story": {
    "0": "God gave us a vision to plant churches on university campuses in cities all around the world.",
    "1": "As an international church that is for the city, we value transculturalism and we are actively reaching out to people from all walks of life, specifically university students, working adults, and families. We want to reach students in the university campuses around Hong Kong because we believe that university is a pivotal time for people to discover their God-given destiny. We are also reaching out to working adults and families so that they can be the salt and light of this city in their spheres of influence.",
    "2": "It is our passion for the local church to continue to be a viable demonstration of His love, seeing more people radically changed through the Gospel, trained to be a Christ disciple, and sent out to other nations to be the light unto the world.",
    "3": "God continues to write our story and we cannot wait to see how it will unfold. One thing that we do know is that our vision will always remain the same. We desire to see people’s lives transformed, redirected to God’s purposes, and set out to transform the world for the glory of God."
  },
  "visionMissionValues": {
    "visionMission": {
      "vision": "Multiplying churches in campuses and cities to transform the next generation among the nations.",
      "mission": "To transform lost people into Christ's disciples who will then transform the world."
    },
    "values": {
      "head": {
        "0": "S-Spirit-led ministry",
        "1": "L-Leadership development",
        "2": "T-Transculturalism",
        "3": "C-Community",
        "4": "M-Ministry inside and outside",
        "5": "M-Missions through church planting",
        "6": "D-Discipleship"
      },
      "body": {
        "0": "To be connected with God and anointed by His Spirit, in order to hear His direction and step out in faith to minister to His people with His power.",
        "1": "To develop people to their full potential and in Christ-like character in order to impact their spheres of influence and increase the spread of the Gospel to future generations.",
        "2": "To make the decision to go through discomforts and difficulties, in order to develop understanding and delight in people from a different culture.",
        "3": "To willingly come together as a diverse group of people to experience and live out the Gospel, in order to fulfill God’s purposes.",
        "4": "To be a visible display and viable demonstration of God's Kingdom by stewarding our God-given spiritual gift(s), resources and experiences to build God’s Church and transform the world.",
        "5": "To obey and fulfill the Great Commission through the local church, which God has established so that we can be witnesses and servants of His redemptive purpose.",
        "6": "To invite people to join us in the lifestyle of the Kingdom by imitating Christ, teaching people to obey Him, and imparting Biblical values"
      }
    }
  },
  "strategy": {
    "0": {
      "title": "Gather",
      "subtitle": "Corporate Gatherings & Community Gatherings",
      "0": "We gather to foster a greater sense of unity and to continue to build up the church body:",
      "1": "Corporate Gatherings are what we do together as the local body of Christ, such as Sunday Celebration, retreats, and baptism services.",
      "2": "Community Gatherings are what we do in biblical community, specifically LIFE Group."
    },
    "1": {
      "title": "Grow",
      "subtitle": "Life-on-Life & Equipping",
      "0": "We believe it is crucial that we do not grow stagnant in our faith, but that we are continually learning and being challenged:",
      "1": "Life-on-Life involves intentional relationships like Life Change Groups (LCG) and discipleship, which allows us to sharpen each other as Christ-followers.",
      "2": "Equipping entails purposeful investment in people to live a transformed life through opportunities such as Experiencing Classes, Freedom Class, ministry team service, and learning to study the Bible and pray."
    },
    "2": {
      "title": "Go",
      "subtitle": "Personal Mission & Team-Based Mission",
      "0": "We have been called to go out and make disciples, by sharing the Good News and testifying of the work God has done in our lives:",
      "1": "Personal Mission happens when an individual lives as the salt and light in our world, shares his/her faith with others and invites people into our community.",
      "2": "Team-Based Mission happens when we partner together for God's kingdom purposes through opportunities like missional initiatives, missions teams, and church plant teams."
    }
  },
  "beliefs": {
    "head": {
      "0": "The Bible",
      "1": "God",
      "2": "Jesus Christ",
      "3": "The Holy Spirit",
      "4": "Man",
      "5": "Salvation",
      "6": "Future Events",
      "7": "The Church",
      "8": "Ordinances"
    },
    "body": {
      "0": "We believe the Bible, both the Old and New Testaments, is the only inspired, infallible, and authoritative Word of God. It is the supreme source of truth for Christian faith and living.",
      "1": "We believe in one God, Creator of all things, infinitely perfect and eternally existing in three persons: Father, Son, and Holy Spirit.",
      "2": "We believe that Jesus Christ is true (fully) God and true (fully) man, having been conceived of the Holy Spirit and born of the virgin Mary. He died on the cross, the complete and final sacrifice for our sins according to the Scriptures. He arose bodily from the dead, and ascended into heaven where, at God’s right hand, He intercedes for His people and rules as Lord over all.",
      "3": "We believe that the ministry of the Holy Spirit is to glorify the Lord Jesus Christ, and during this age to convict the world of sin. He also regenerates the believing sinner, indwelling, guiding, instructing, and empowering us for godly living and sacrifice.",
      "4": "We believe that the man was created in the image of God, but fell into sin and is therefore destined for eternal death. Only through regeneration by the Holy Spirit can salvation and spiritual life be obtained.",
      "5": "We believe that the shed blood of Jesus Christ and His resurrection provide the only grounds for justification and salvation for all who believe, and only those who receive Jesus Christ by faith are born of the Holy Spirit and thus become children of God.",
      "6": "We believe in the visible, personal, glorious, imminent return of Jesus Christ, His bodily resurrection of the dead, the judgment of the just and the unjust, and the fulfillment of Christ’s Kingdom in the new heavens and the new earth. Then shall the eager expectation of creation be fulfilled and the whole earth shall proclaim the glory of God who makes all things new.",
      "7": "We believe that the true Church is composed of all such persons who through saving faith in Jesus Christ have been regenerated by the Holy Spirit and are united together in the body of Christ. We believe that Jesus Christ is the Head of the Church, and that every local church has the right under Christ to decide and govern its own affairs.",
      "8": "We believe that water baptism and the Lord's Supper are ordinances to be observed by the Church during the present age. They are, however, not to be regarded as means of salvation."
    }
  },
  "staff": {
    "pastoral": {
      "kim": {
        "title": "Rev. Dr. Seth S. Kim",
        "position": "Lead Pastor (Hong Kong)\n seth.kim@hmcc.net \nGlobal Leadership Team Member",
        "0": "Seth Kim has been educated and awarded degrees from the University of Illinois, Trinity International University, and Gordon-Conwell Theological Seminary.",
        "1": "Seth is a pastor, speaker, leadership educator, church planter, and spiritual trainer. He works extensively with university students and desires to raise up the next generation of world influencers by developing people and seeing their lives transformed so that they can then transform the world. Seth travels frequently around the world to work with different churches and organizations to train and equip people. Seth has planted churches in the U.S., SE Asia, and East Asia. In 2023, he co-founded Arise Asia and now serves as the Vice-President. He also serves as the East Asia Regional Director for the Lausanne Movement",
        "2": "Seth desires to see young people surrender their lives for God’s mission and to go where there is no gospel. He also serves and helps with Movement Day, CPX, and NXT Move Global. Seth and his wife have been married since 1996 and have three grown children."
      }
    },
    "directors": [
      {
        "photo": "staff-anne.jpg",
        "name": "Anne Hu",
        "title": ["Education & Training", "Campus Ministry"]
      },
      {
        "photo": "staff-joanna.jpg",
        "name": "Joanna Jing",
        "title": ["Corporate Operations & Events", "City Ministry"]
      },
      {
        "photo": "staff-peter.jpg",
        "name": "Peter Young",
        "title": ["Youth & Families Ministry", "Worship Ministry"]
      }
    ]
  },
  "ourHeartMissions": {
    "title": {
      "1": "Our Heart For Missions",
      "2": "Harvest Mission International (HMI)",
      "3": "Missional Initiatives"
    },
    "heading": {
      "1": "Missions Month",
      "2": "!gnite Conference",
      "3": "The Vision"
    },
    "blurb": {
      "1": "As Christ has called us to ‘make disciples of all nations’ (Matthew 28:19), we value the importance of the local church making an impact in its surrounding community for the Gospel of Jesus Christ.",
      "2": "Similar to the early church seen in the Book of Acts, we believe in doing missions through planting churches. It is our desire to establish and raise up visible local bodies of Christ’s followers who are witnesses to their own communities. Specifically, we seek to target cities with viable college campuses, as students are the future leaders of our world. As a church reaches a campus, we believe that it will begin to impact the community, the city, and ultimately, the nations. Currently HMI is involved in short-term projects both locally and internationally. Starting in Ann Arbor, HMI now has church plants in Austin, Detroit, Jakarta, Indonesia, and Hong Kong.",
      "3": "Since 2016, we dedicate the month of November each year to learn about and grow a heart for missions. As a whole church, we come together and serve our communities as we live missionally for Christ through outreaches in campuses and around the city, partnering with various NGOs to serve those in need, and reaching out to friends and families.",
      "4": "These are the Missions Month themes in the past:",
      "5": "Started in 2011, !gnite Conference is HMCC’s annual church conference that aims to ",
      "5.5": "!gnite everyone with a passion for God so they can reach every nation in our generation with the Gospel.",
      "6": "All throughout history, we have seen God set people’s hearts on fire in order to live a radical life for His glory. We are praying that in our generation, God would set the hearts of many students on fire so that we may burn for Him.",
      "7": "What would it be like if we saw a whole generation of people who are set on fire with God’s glory and love? If they were excited and passionate about bringing the Gospel to every nation? ",
      "7.5": "Simply, we would see a generation of people living radically for Jesus Christ.",
      "8": "We are living in a unique time in history. God has been sovereignly orchestrating events and circumstances throughout the world in order for a new generation to rise up and hear the call to take the Gospel to every nation. This is why we have !gnite!"
    }
  }
}
